{
  "format": "layers-model",
  "generatedBy": "keras v3.11.3",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.11.3",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_3",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": { "name": "float32" },
          "registered_name": null
        },
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 128, 128, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer_3"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_13",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_14",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_9",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_15",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "rate": 0.2,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_14",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_15",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_10",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_16",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "rate": 0.2,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_15",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_16",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_11",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_17",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "GlobalAveragePooling2D",
            "config": {
              "name": "global_average_pooling2d_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_18",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "rate": 0.4,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_6",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_19",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_7",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 4,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [null, 128, 128, 3]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "loss_weights": null,
      "metrics": ["accuracy"],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 9.999999747378752e-5,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_14/gamma",
          "shape": [32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.9171111583709717,
            "scale": 0.0008518588309194528,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_14/beta",
          "shape": [32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.056582323417944065,
            "scale": 0.000460018889576781,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_14/moving_mean",
          "shape": [32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.0003610246058087796,
            "scale": 0.00048289585632600767,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_14/moving_variance",
          "shape": [32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 1.237095693795709e-5,
            "scale": 0.00021545666684901602,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_15/gamma",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.9541754722595215,
            "scale": 0.0005141795850267597,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_15/beta",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.0225467311547083,
            "scale": 0.000450934623094166,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_15/moving_mean",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.027888378128409386,
            "scale": 0.0015104004346272524,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_15/moving_variance",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.016237718984484673,
            "scale": 0.002960714471398615,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_16/gamma",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.9424468874931335,
            "scale": 0.0010552960283616009,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_16/beta",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.15107257518113829,
            "scale": 0.0008210466042453167,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_16/moving_mean",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.00400965940207243,
            "scale": 0.0070187940499654,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_16/moving_variance",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.007478578947484493,
            "scale": 0.0656480457889391,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_13/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.268755468083363,
            "scale": 0.001733906245699116,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_13/bias",
          "shape": [32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.03793939422158634,
            "scale": 0.0003952020231415244,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_14/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.2151431630639469,
            "scale": 0.0014154155464733348,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_14/bias",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.0835006966310389,
            "scale": 0.000579865948826659,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_15/kernel",
          "shape": [3, 3, 64, 128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.13162583761355456,
            "scale": 0.0010701287610858094,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_15/bias",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.07875146383748334,
            "scale": 0.00046598499312120324,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense_6/kernel",
          "shape": [128, 128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.3291777842185077,
            "scale": 0.0025517657691357183,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense_6/bias",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.1039608990152677,
            "scale": 0.00061153470008981,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense_7/kernel",
          "shape": [128, 4],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.19206278183880973,
            "scale": 0.001500490483115701,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense_7/bias",
          "shape": [4],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.04770764743580538,
            "scale": 0.0003727159955922295,
            "original_dtype": "float32"
          }
        }
      ]
    }
  ]
}
