{
  "format": "layers-model",
  "generatedBy": "keras v3.11.3",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.11.3",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_5",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": { "name": "float32" },
          "registered_name": null
        },
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 128, 128, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer_5"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_15",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_15",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_15",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_16",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_16",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_16",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_17",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_17",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_17",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "GlobalAveragePooling2D",
            "config": {
              "name": "global_average_pooling2d_5",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_10",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_17",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_11",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [null, 128, 128, 3]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "loss_weights": null,
      "metrics": ["accuracy"],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 3.125000148429535e-5,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_15/gamma",
          "shape": [32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.34925374388694763,
            "scale": 0.0042509818778318515,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_15/beta",
          "shape": [32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.328944781481051,
            "scale": 0.0024548118020973953,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_15/moving_mean",
          "shape": [32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 1.225021861728237e-7,
            "scale": 0.003776126970205672,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_15/moving_variance",
          "shape": [32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 3.612373289385573e-9,
            "scale": 0.0012676040189860925,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_16/gamma",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.7390895485877991,
            "scale": 0.0021529648818221746,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_16/beta",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.26481548103631714,
            "scale": 0.002878429141699099,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_16/moving_mean",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.029439035803079605,
            "scale": 0.009822431016786426,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_16/moving_variance",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.03218542039394379,
            "scale": 0.06358325113268459,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_17/gamma",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 1.4999550580978394,
            "scale": 0.007634277437247482,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_17/beta",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.3833646507824169,
            "scale": 0.0020283843956741634,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_17/moving_mean",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.004507794976234436,
            "scale": 0.008988548669160582,
            "original_dtype": "float32"
          }
        },
        {
          "name": "batch_normalization_17/moving_variance",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.01088182907551527,
            "scale": 0.05345520159850518,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_15/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.3943828491603627,
            "scale": 0.003057231388840021,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_15/bias",
          "shape": [32],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.13811115996510376,
            "scale": 0.0011320586882385554,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_16/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.641647399523679,
            "scale": 0.004364948296079449,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_16/bias",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.3459957206950468,
            "scale": 0.0019658847766764022,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_17/kernel",
          "shape": [3, 3, 64, 128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.6254892882178812,
            "scale": 0.004009546719345392,
            "original_dtype": "float32"
          }
        },
        {
          "name": "conv2d_17/bias",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.5407186166912902,
            "scale": 0.004432119808945001,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense_10/kernel",
          "shape": [128, 128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -1.7475887812820134,
            "scale": 0.012572581160302255,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense_10/bias",
          "shape": [128],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.15348298187349357,
            "scale": 0.0018717436813840678,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense_11/kernel",
          "shape": [128, 3],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -1.1448157993017458,
            "scale": 0.005425667295268937,
            "original_dtype": "float32"
          }
        },
        {
          "name": "dense_11/bias",
          "shape": [3],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.6073376029145484,
            "scale": 0.00572960002749574,
            "original_dtype": "float32"
          }
        }
      ]
    }
  ]
}
